---
kind: type
id: T:Autodesk.Revit.DB.PolymeshFacet
source: html/a7315aaf-631d-96af-368c-65f86b6c00ef.htm
---
# Autodesk.Revit.DB.PolymeshFacet

A class representing one triangular piece - a facet - in a polymesh topology.

## Syntax (C#)
```csharp
public class PolymeshFacet
```

## Remarks
It can also be used to create TopographySurface.
 Each facet is defined by indices of three vertices of the polymesh.